[
  {
    "class": "Occult",
    "description": "this shotgun literally belongs to god. im serious. even holding this thing might burn your palms.",
    "dmg": 100,
    "name": "God's Boomstick",
    "ndmg": 100,
    "odmg": 750,
    "price": 100000,
    "rarity": "Signature",
    "shape": "Shotgun",
    "size": "Two-Handed"
  },
  {
    "class": "Neo",
    "description": "Omnigon Technologies' most recent iteration of their flagship Kestrel railpistol. Sleek, powerful and more efficient than ever, the user could go their entire lives without needing to replace the internal battery.",
    "dmg": 100,
    "name": "Omnigon I3 Kestrel",
    "ndmg": 100,
    "odmg": 750,
    "price": 100000,
    "rarity": "Signature",
    "shape": "Pistol",
    "size": "One-Handed"
  },
  {
    "class": "Spiritbound",
    "description": "Spiritbound Revolver series infamous for its unethical spiritbinding method. Inexperienced wielders beware; the demon housed inside is not there willingly.",
    "dmg": 75,
    "name": "Ainsoph DC1 Cthonica",
    "ndmg": 50,
    "odmg": 175,
    "price": 800,
    "rarity": "Rare",
    "shape": "Revolver",
    "size": "Two-Handed"
  },
  {
    "class": "Neo",
    "description": "A mysterious, entirely custom-made pneumatic sniper rifle, firing pulses of superheated gas as projectiles. No one knows who built this, only the letters 'AVGD' are scratched into the grip.",
    "dmg": 50,
    "name": "Avogadro",
    "ndmg": 500,
    "odmg": 0,
    "price": 10000,
    "rarity": "Signature",
    "shape": "Sniper Rifle",
    "size": "Two-Handed"
  },
  {
    "class": "Neo",
    "description": "RedDevil Arms' one and only consumer-grade railgun firearm. The receiver includes A heat coil, allowing for incandescent, molten projectiles. Has a small chance of exploding in your hands mid-operation; RedDevil claims no responsibility.",
    "dmg": 75,
    "name": "RedDevil D1 Blackdog",
    "ndmg": 75,
    "odmg": 0,
    "price": 600,
    "rarity": "rare",
    "shape": "Assault Rifle",
    "size": "Two-Handed"
  },
  {
    "class": "Neo",
    "description": "Omnigon's very first model of their flagship railgun pistol. Pathetically clunky and obsolete by 2092, though a great trophy of nostalgia and legacy.",
    "dmg": 5,
    "name": "Omnigon I1 Kestrel",
    "ndmg": 10,
    "odmg": 0,
    "price": 50,
    "rarity": "Common",
    "shape": "Pistol",
    "size": "One-Handed"
  },
  {
    "class": "Neo",
    "description": "Successor to the antique I1 model. Includes an energy recollection system for improved battery life. Outdated, but not a bad choice at all for self-defense.",
    "dmg": 10,
    "name": "Omnigon I2 Kestrel",
    "ndmg": 25,
    "odmg": 0,
    "price": 100,
    "rarity": "Common",
    "shape": "Pistol",
    "size": "One-Handed"
  }
],
{
  "class": "Neo",
  "description": "A Prototype of Omnigon's anticipated successor to the current I3 model. Expected to be the Magnum Opus of the Kestrel Lineup, the I4-X features an inverter dial; the wielder could fire low-power bursts, or high-power single bolts of scientific wrath.",
  "dmg": 40,
  "name": "Omnigon I4-X Kestrel",
  "ndmg": 115,
  "odmg": 0,
  "price": 2500,
  "rarity": "rare",
  "shape": "Pistol",
  "size": "Two-Handed"
},
{
  "class": "Neo",
  "description": "One of the first pieces of railgun technology to hit the public market. Incredibly outdated, but each and every unit has its own veteran story to tell.",
  "dmg": 10,
  "name": "Omnigon PR-1 Peregrine",
  "ndmg": 15,
  "odmg": 0,
  "price": 75,
  "rarity": "Junk",
  "shape": "Assault Rifle",
  "size": "Two-Handed"
},
{
  "class": "Neo",
  "description": "A Significant upgrade from previous model, the PR-2 Peregrine boasted a lighter overall weight and full-auto design. A long barrel-mounted bayonet is a striking feature of the PR-2, reflecting the Razor Forties it was released in; as much of a compact Halberd as it is an AR.",
  "dmg": 20,
  "name": "Omnigon PR-2 Peregrine",
  "ndmg": 25,
  "odmg": 0,
  "price": 100,
  "rarity": "Common",
  "shape": "Assault Rifle",
  "size": "Two-Handed"
},
{
  "class": "Neo",
  "description": "The most recent and successful model of the Peregrine line. Denser ammunition, Improved accuracy and effective range, and a plethora of picatinny rails for modular attachments. A versatile and powerful gold-standard of assault rifles, and nothing short of another masterpiece by Omnigon Technologies.",
  "dmg": 20,
  "name": "Omnigon PR-4 Peregrine",
  "ndmg": 25,
  "odmg": 0,
  "price": 100,
  "rarity": "Common",
  "shape": "Assault Rifle",
  "size": "Two-Handed"
},
